{
    "mercury": {
        "description": "Mercury is the smallest and innermost planet in the Solar System, located 0.39 astronomical units from the Sun. It has a diameter of 4,880 kilometers and a mass of 3.3 x 10^23 kilograms, making it only slightly larger than Earth's moon. Mercury is a rocky, terrestrial planet with a heavily cratered surface and a thin atmosphere composed mostly of helium and trace amounts of other gases. The planet has a slow rotation and completes three rotations for every two orbits around the sun, resulting in a day that is longer than its year. Mercury has no moons or rings and is the second hottest planet after Venus, with a maximum temperature of 800 degrees Fahrenheit (430 degrees Celsius) on its daytime side due to its proximity to the sun. Mercury was first observed and studied by ancient civilizations, including the Babylonians and Greeks, and has been explored by multiple spacecraft in recent decades, including NASA's MESSENGER mission."
    },
    "venus": {
        "description": "Venus is the the second planet of the Solar System in order of distance from the Sun, being located 0.72 astronomical units from it in the inner solar system. It has a similar size and composition to Earth, with a diameter of 12,104 kilometers and a mass of 4.87 x 10^24 kilograms. The planet has a slow retrograde rotation, meaning it rotates on its axis in the opposite direction to its orbit around the sun, taking 243 Earth days to complete one rotation. Venus has a thick atmosphere primarily composed of carbon dioxide with trace amounts of nitrogen and other gases, as well as sulfuric acid clouds that obscure the surface from visible light. Due to its thick atmosphere and runaway greenhouse effect it experiences extreme surface temperatures, with a maximum temperature of 864 degrees Fahrenheit (462 degrees Celsius). Venus has been observed and studied since ancient times, with the earliest recorded observations dating back to Babylonian astronomers in the 17th century BCE."
    },
    "earth": {
        "description": "Earth is the third planet from the Sun."
    },
    "mars": {
        "description": "Mars is the fourth planet from the Sun and is often referred to as the Red Planet. The Sun is the star at the center of the solar system and is by far the largest object in it. It has a diameter of about 1.39 million kilometers and a mass of approximately 1.99 x 10^30 kilograms, accounting for about 99.86% of the total mass of the solar system. The Sun is a nearly perfect sphere of hot plasma, with internal convective motion that generates its magnetic field. The temperature at the Sun's core is about 15 million degrees Celsius, where nuclear fusion occurs, releasing energy in the form of electromagnetic waves and heat. This energy is radiated outwards, and it takes about 8 minutes and 20 seconds for it to reach Earth, which is about 149.6 million kilometers away. The Sun rotates on its axis, completing one rotation in about 25.4 Earth days near the equator and about 34 Earth days near the poles. The Sun is classified as a G-type main-sequence star, with a lifespan of about 10 billion years, and it has a complex system of magnetic activity that produces sunspots, flares, and coronal mass ejections that can affect Earth's space environment. The Sun has been studied extensively by a variety of telescopes and spacecraft, including the Solar and Heliospheric Observatory (SOHO) and the Parker Solar Probe."
    },
    "jupiter": {
        "description": "Jupiter is the largest planet in the Solar System, located fifth from the sun. It has a diameter of 139,822 kilometers and a mass of 1.898 x 10^27 kilograms, making it more than twice as massive as all the other planets in the Solar System combined. Jupiter is a gas giant planet composed mostly of hydrogen and helium, with a small rocky core at its center. The planet has a banded appearance, with swirling cloud formations and a famous Great Red Spot, a persistent high-pressure storm in the planet's atmosphere that is larger than the size of Earth. Jupiter has a rapid rotation, with a day length of 9.9 hours, and it orbits the sun once every 11.86 Earth years. The planet has 79 known moons, including four large Galilean moons: Io, Europa, Ganymede, and Callisto. Jupiter has been explored by multiple spacecraft, including the Galileo mission and NASA's Juno mission, which is currently in orbit around the planet."
    },
    "saturn": {
        "description": "Saturn is the sixth planet from the Sun and is the second largest planet in the Solar System after Jupiter. It has a diameter of 116,460 kilometers and a mass of 5.68 x 10^26 kilograms, making it approximately 95 times more massive than Earth. Saturn is a gas giant planet with a composition similar to Jupiter, primarily composed of hydrogen and helium with trace amounts of other gases. The planet is famous for its extensive ring system, consisting of numerous narrow, bright rings composed of ice particles, rock debris, and dust. Saturn has a day length of 10.7 hours and an orbital period of 29.4 Earth years. The planet has 82 known moons, with the largest being Titan, a moon with a thick atmosphere and the only known moon with stable liquid on its surface. The planet has been explored by multiple spacecraft, including NASA's Cassini-Huygens mission, which spent 13 years in orbit around Saturn and its moons."
    },
    "uranus": {
        "description": "Uranus is the seventh planet from the sun, and it is the third-largest planet in the solar system. It has a diameter of 50,724 kilometers and a mass of 8.68 x 10^25 kilograms, making it about 14.5 times more massive than Earth. Uranus is an ice giant planet, primarily composed of water, methane, and ammonia, and has the coldest atmosphere in the solar system with temperatures that can dip down to -224°C (-371°F). The planet has a tilted axis of rotation, which causes it to rotate on its side with its poles pointing towards the sun. Uranus has a day length of approximately 17.2 Earth hours and an orbital period of 84 Earth years. The planet has 27 known moons, with the largest being Titania and Oberon. Uranus also has a faint ring system, which was discovered in 1977 during a stellar occultation. Uranus has been explored by only one spacecraft, NASA's Voyager 2, which flew by the planet in 1986, providing the most detailed images and data of the planet and its moons to date."
    },
    "neptune": {
        "description": "Neptune is the eighth and farthest planet from the sun, and it is the fourth-largest planet in the solar system. It has a diameter of 49,244 kilometers and a mass of 1.02 x 10^26 kilograms, making it about 17 times more massive than Earth. Neptune is an ice giant planet, primarily composed of water, methane, and ammonia, and has a deep, turbulent atmosphere with strong winds and large storms, including the famous Great Dark Spot and the smaller Dark Spot. The planet has a day length of approximately 16.1 Earth hours and an orbital period of 165 Earth years. Neptune has 14 known moons, with the largest being Triton, a captured Kuiper Belt object with a highly inclined and retrograde orbit. Neptune also has a faint and dynamic ring system, which was discovered in 1984 during a stellar occultation. The planet has been explored by only one spacecraft, NASA's Voyager 2, which flew by the planet in 1989, providing the most detailed images and data of the planet and its moons to date."
    },
    "pluto": {
        "description": ""
    },
    "sun": {
        "description": ""
    }
}


    
  